In [2]:
import pandas as pd

In [7]:
#let's define a two dimensional pandas dataframe
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]':[3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [3]:
type(bank_client_df)

pandas.core.frame.DataFrame

In [4]:
#view first couple of rows
bank_client_df.head(2)

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4

In [6]:
#view last couple of rows
bank_client_df.tail(2)

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [4]:
#minichallenge 6
#Portfolio contains a collection of securities such a stocks 
#bonds and ETFs. Define a data frame named 'portfolio_df' that 
#holds three difference stock ticker symbols, number of shares
#and price per share.
# Calculate the total value of the portfolio including all stocks.
portfolio_df = pd.DataFrame({'Stock ticker symbol':['AAPL', 'AMZN', 'T'],
                             'price per share [$]':[3500, 200, 40],
                             'Number of stocks':[3, 4, 9]})
portfolio_df

  Stock ticker symbol  price per share [$]  Number of stocks
0                AAPL                 3500                 3
1                AMZN                  200                 4
2                   T                   40                 9

In [7]:
stocks_dollar_value = portfolio_df['price per share [$]'] * portfolio_df['Number of stocks']
stocks_dollar_value

0    10500
1      800
2      360
dtype: int64

In [8]:
stocks_dollar_value.sum()

11660

In [9]:
#read tabular data using read_html
house_price_df = pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
house_price_df[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [10]:
house_price_df[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [22]:
#pandas operation
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]':[3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [23]:
#pick certain rows that satisfy a certain criteria
df_loyal = bank_client_df[bank_client_df ['Years with bank'] >=5 ]
df_loyal

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [24]:
#delete a coloumn from the dataframe
del bank_client_df['Bank Client ID']

In [25]:
bank_client_df

  Bank Client Name  Net Worth [$]  Years with bank
0           Chanel           3500                3
1            Steve          29000                4
2            Mitch          10000                9
3             Ryan           2000                5

In [26]:
#Select high networth individuals with minimum $5000
#combined networth for all customers with 5000+ networth?
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]':[3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [27]:
high_networth = bank_client_df[ bank_client_df['Net Worth [$]'] >= 5000]
high_networth

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
1             222            Steve          29000                4
2             333            Mitch          10000                9

In [30]:
high_networth['Net Worth [$]'].sum()

39000

In [31]:
#define a function that increases all clients networth by a fixed value of 20%
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]':[3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]})
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [32]:
def networth_update(balance):
    return balance * 1.2

In [34]:
bank_client_df['Net Worth [$]'].apply(networth_update)

0     4200.0
1    34800.0
2    12000.0
3     2400.0
Name: Net Worth [$], dtype: float64

In [35]:
#len function (predefined)
bank_client_df['Bank Client Name'].apply(len)

0    6
1    5
2    5
3    4
Name: Bank Client Name, dtype: int64

In [43]:
#minichallenge 9
#define a function that triples the stock price and adds 200$
#calculate the updated total networths of all the clients combined
def networth_update(balance):
    return balance * 3 + 200
results = bank_client_df['Net Worth [$]'].apply(networth_update)
results.sum()

134300

In [46]:
#sorting the value (not changing the memory)
bank_client_df = pd.DataFrame({'Bank Client ID':[111, 222, 333, 444],
                               'Bank Client Name':['Chanel', 'Steve', 'Mitch', 'Ryan'],
                               'Net Worth [$]':[3500, 29000, 10000, 2000],
                               'Years with bank': [3, 4, 9, 5]})
bank_client_df.sort_values(by= 'Years with bank')

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [47]:
#sorting the value (not changing the memory) by using inplace = true
bank_client_df.sort_values(by= 'Years with bank', inplace= True)

In [48]:
bank_client_df

   Bank Client ID Bank Client Name  Net Worth [$]  Years with bank
0             111           Chanel           3500                3
1             222            Steve          29000                4
3             444             Ryan           2000                5
2             333            Mitch          10000                9

In [49]:
#CONCATENATE & MERGING WITH PANDAS
df1 = pd.DataFrame({ 'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']},
index =[0, 1, 2, 3])

In [51]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [52]:
df2 = pd.DataFrame({ 'A': ['A4', 'A5', 'A6', 'A7'],
                     'B': ['B4', 'B5', 'B6', 'B7'],
                     'C': ['C4', 'C5', 'C6', 'C7'],
                     'D': ['D4', 'D5', 'D6', 'D7']},
index =[4, 5, 6, 7])

df3 = pd.DataFrame({ 'A': ['A8', 'A9', 'A10', 'A11'],
                     'B': ['B8', 'B9', 'B10', 'B11'],
                     'C': ['C8', 'C9', 'C10', 'C11'],
                     'D': ['D8', 'D9', 'D10', 'D11']},
index =[8, 9, 10, 11])

In [53]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11